In [364]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\vonke\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [365]:
#Importing our defined functions
from clean_data_functions import *

In [366]:
import pandas as pd

url = 'https://raw.githubusercontent.com/johann1043/Data-Science-Quest/main/jobs_in_data.csv'
data_science_df = pd.read_csv(url)

# Cleaning data_science Data Frame

In [367]:
#Getting initial overview of data frame
data_frame_overview(data_science_df)

Column names:
 Index(['work_year', 'job_title', 'job_category', 'salary_currency', 'salary',
       'salary_in_usd', 'employee_residence', 'experience_level',
       'employment_type', 'work_setting', 'company_location', 'company_size'],
      dtype='object')

Dimensions: (9355, 12)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9355 entries, 0 to 9354
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           9355 non-null   int64
 1   job_title           9355 non-null   object
 2   job_category        9355 non-null   object
 3   salary_currency     9355 non-null   object
 4   salary              9355 non-null   int64
 5   salary_in_usd       9355 non-null   int64
 6   employee_residence  9355 non-null   object
 7   experience_level    9355 non-null   object
 8   employment_type     9355 non-null   object
 9   work_setting        9355 non-null   object
 10  company_location    9355 non-null   object
 11  company_size        9355 non-null   object
dtypes: int64(3), object(9)
memory usage: 877.2+ KB
None

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
5,2023,Data Scientist,Data Science and Research,USD,130000,130000,United States,Senior,Full-time,Remote,United States,M
6,2023,Data Scientist,Data Science and Research,USD,100000,100000,United States,Senior,Full-time,Remote,United States,M
7,2023,Machine Learning Researcher,Machine Learning and AI,USD,224400,224400,United States,Mid-level,Full-time,In-person,United States,M
8,2023,Machine Learning Researcher,Machine Learning and AI,USD,138700,138700,United States,Mid-level,Full-time,In-person,United States,M
9,2023,Data Engineer,Data Engineering,USD,210000,210000,United States,Executive,Full-time,Remote,United States,M

In [368]:
#Applying the reformatting the names of the columns
column_name_mapping = {'work_year' : 'year', 'employee_residence' : 'country'}

format_column_names(data_science_df, column_name_mapping)

New column names:
 Index(['year', 'job_title', 'job_category', 'salary_currency', 'salary',
       'salary_in_usd', 'country', 'experience_level', 'employment_type',
       'work_setting', 'company_location', 'company_size'],
      dtype='object')

In [369]:
null_check(data_science_df)

Total null values per row:
0       0
1       0
2       0
3       0
4       0
       ..
9350    0
9351    0
9352    0
9353    0
9354    0
Length: 9355, dtype: int64

Total null values per column:
year                0
job_title           0
job_category        0
salary_currency     0
salary              0
salary_in_usd       0
country             0
experience_level    0
employment_type     0
work_setting        0
company_location    0
company_size        0
dtype: int64

In [370]:
# dup_check(data_science_df)

In [371]:
# duplicates = data_science_df.duplicated(keep=False)

# duplicate_rows = data_science_df.loc[duplicates]
# print(duplicate_rows)

In [372]:
# drop_dup_reset(data_science_df)

In [373]:
data_science_df = data_science_df.drop(['job_title', 'salary_currency','salary','company_location','company_size'], axis=1)
data_science_df

,year,job_category,salary_in_usd,country,experience_level,employment_type,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Full-time,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,Full-time,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,Full-time,In-person
3,2023,Data Science and Research,212000,United States,Senior,Full-time,In-person
4,2023,Data Science and Research,93300,United States,Senior,Full-time,In-person
...,...,...,...,...,...,...,...
9350,2021,Data Management and Strategy,165000,United States,Senior,Full-time,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Full-time,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Full-time,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Full-time,Remote
9354,2020,Data Analysis,100000,United States,Entry-level,Contract,Remote

In [374]:
data_science_df = data_science_df[data_science_df['employment_type'] == 'Full-time']
data_science_df

,year,job_category,salary_in_usd,country,experience_level,employment_type,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Full-time,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,Full-time,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,Full-time,In-person
3,2023,Data Science and Research,212000,United States,Senior,Full-time,In-person
4,2023,Data Science and Research,93300,United States,Senior,Full-time,In-person
...,...,...,...,...,...,...,...
9349,2021,Data Engineering,28369,Malta,Mid-level,Full-time,Hybrid
9350,2021,Data Management and Strategy,165000,United States,Senior,Full-time,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Full-time,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Full-time,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Full-time,Remote

In [375]:
data_science_df = data_science_df.drop(['employment_type'], axis=1)
data_science_df

,year,job_category,salary_in_usd,country,experience_level,work_setting
0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid
1,2023,Data Architecture and Modeling,186000,United States,Senior,In-person
2,2023,Data Architecture and Modeling,81800,United States,Senior,In-person
3,2023,Data Science and Research,212000,United States,Senior,In-person
4,2023,Data Science and Research,93300,United States,Senior,In-person
...,...,...,...,...,...,...
9349,2021,Data Engineering,28369,Malta,Mid-level,Hybrid
9350,2021,Data Management and Strategy,165000,United States,Senior,Remote
9351,2020,Data Science and Research,412000,United States,Senior,Remote
9352,2021,Data Science and Research,151000,United States,Mid-level,Remote
9353,2020,Data Science and Research,105000,United States,Entry-level,Remote

# Cleaning global_salary Data Frame

In [376]:
import pandas as pd

url = 'https://raw.githubusercontent.com/johann1043/Data-Science-Quest/main/salary_data.csv'
global_salary_df = pd.read_csv(url)

In [377]:
global_salary_df

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
0,Afghanistan,Asia,Monthly,853.740000,1001.150000,252.530000,4460.970000
1,Aland Islands,Europe,Monthly,3319.240000,3858.350000,972.520000,17124.740000
2,Albania,Europe,Monthly,832.840000,956.920000,241.220000,4258.490000
3,Algeria,Africa,Monthly,1148.840000,1308.810000,330.110000,5824.180000
4,American Samoa,Oceania,Monthly,1390.000000,1570.000000,400.000000,6980.000000
...,...,...,...,...,...,...,...
216,Virgin Islands (US),North America,Monthly,2380.000000,2710.000000,680.000000,12000.000000
217,Western Sahara,Africa,Monthly,908.560000,1011.670000,254.860000,4503.890000
218,Yemen,Asia,Monthly,120.980000,133.360000,33.620000,594.930000
219,Zambia,Africa,Monthly,0.261335,0.285524,0.072092,1.271103
220,Zimbabwe,Africa,Monthly,555.402040,602.376350,151.423050,2674.772000

In [378]:
#Getting initial overview of data frame
data_frame_overview(global_salary_df)

Column names:
 Index(['country_name', 'continent_name', 'wage_span', 'median_salary',
       'average_salary', 'lowest_salary', 'highest_salary'],
      dtype='object')

Dimensions: (221, 7)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 221 entries, 0 to 220
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   country_name    221 non-null    object
 1   continent_name  221 non-null    object
 2   wage_span       221 non-null    object
 3   median_salary   221 non-null    float64
 4   average_salary  221 non-null    float64
 5   lowest_salary   221 non-null    float64
 6   highest_salary  221 non-null    float64
dtypes: float64(4), object(3)
memory usage: 12.2+ KB
None

,country_name,continent_name,wage_span,median_salary,average_salary,lowest_salary,highest_salary
0,Afghanistan,Asia,Monthly,853.74,1001.15,252.53,4460.97
1,Aland Islands,Europe,Monthly,3319.24,3858.35,972.52,17124.74
2,Albania,Europe,Monthly,832.84,956.92,241.22,4258.49
3,Algeria,Africa,Monthly,1148.84,1308.81,330.11,5824.18
4,American Samoa,Oceania,Monthly,1390.00,1570.00,400.00,6980.00
5,Andorra,Europe,Monthly,3668.08,4069.77,1120.51,17653.28
6,Angola,Africa,Monthly,284.39,314.39,79.32,1403.96
7,Antigua and Barbuda,Caribbean,Monthly,1548.15,1677.78,422.22,7444.44
8,Argentina,South America,Monthly,110.28,129.42,32.57,577.13
9,Armenia,Asia,Monthly,1700.25,1974.32,497.39,8780.39

In [379]:
#Applying the reformatting the names of the columns
column_name_mapping = {'country_name' : 'country', 'average_salary': 'global_average_salary'}

format_column_names(global_salary_df, column_name_mapping)

New column names:
 Index(['country', 'continent_name', 'wage_span', 'median_salary',
       'global_average_salary', 'lowest_salary', 'highest_salary'],
      dtype='object')

In [380]:
null_check(global_salary_df)

Total null values per row:
0      0
1      0
2      0
3      0
4      0
      ..
216    0
217    0
218    0
219    0
220    0
Length: 221, dtype: int64

Total null values per column:
country                  0
continent_name           0
wage_span                0
median_salary            0
global_average_salary    0
lowest_salary            0
highest_salary           0
dtype: int64

In [381]:
dup_check(global_salary_df)

Duplicates found: False

Number of duplicates: 0

In [382]:
global_salary_df = global_salary_df.drop(['continent_name', 'wage_span','median_salary','lowest_salary','highest_salary'], axis=1)
global_salary_df

                 country  global_average_salary
0            Afghanistan            1001.150000
1          Aland Islands            3858.350000
2                Albania             956.920000
3                Algeria            1308.810000
4         American Samoa            1570.000000
..                   ...                    ...
216  Virgin Islands (US)            2710.000000
217       Western Sahara            1011.670000
218                Yemen             133.360000
219               Zambia               0.285524
220             Zimbabwe             602.376350

[221 rows x 2 columns]

In [383]:
global_salary_df['global_average_salary'] = global_salary_df['global_average_salary'].map(lambda x: x * 12).round(0)
global_salary_df

                 country  global_average_salary
0            Afghanistan                12014.0
1          Aland Islands                46300.0
2                Albania                11483.0
3                Algeria                15706.0
4         American Samoa                18840.0
..                   ...                    ...
216  Virgin Islands (US)                32520.0
217       Western Sahara                12140.0
218                Yemen                 1600.0
219               Zambia                    3.0
220             Zimbabwe                 7229.0

[221 rows x 2 columns]

In [384]:
country_list = data_science_df['country'].unique()

In [385]:
for country in country_list:
    # Check if the country is in the 'country' column of global_salary_df
    if country in global_salary_df['country'].values:
        True
    else:
        print(f'Cannot find {country}.')

Cannot find South Korea.
Cannot find Kuwait.

# Merge the two Data Frames and export

In [386]:
# Merge DataFrames on the common column
clean_data_df = pd.merge(data_science_df, global_salary_df, on='country', how='inner')
clean_data_df

,year,job_category,salary_in_usd,country,experience_level,work_setting,global_average_salary
0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48584.0
1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48584.0
2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48584.0
3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48584.0
4,2023,Data Engineering,107968,Germany,Senior,Remote,48584.0
...,...,...,...,...,...,...,...
9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58441.0
9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.0
9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.0
9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.0
9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.0

In [387]:
# Export
# clean_data_df.to_csv('clean_data.csv', index=False)

# Create Tables

In [388]:
clean_data_df.reset_index(inplace=True)

In [389]:
clean_data_df

,index,year,job_category,salary_in_usd,country,experience_level,work_setting,global_average_salary
0,0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48584.0
1,1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48584.0
2,2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48584.0
3,3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48584.0
4,4,2023,Data Engineering,107968,Germany,Senior,Remote,48584.0
...,...,...,...,...,...,...,...,...
9302,9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58441.0
9303,9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.0
9304,9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.0
9305,9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.0
9306,9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.0

## Create global_average_salary table

In [390]:
global_average_salary = sorted(list(clean_data_df['global_average_salary'].unique()))
global_average_salary

[1284.0,
 1553.0,
 3419.0,
 3434.0,
 3582.0,
 4613.0,
 5261.0,
 5267.0,
 7474.0,
 8380.0,
 8392.0,
 8535.0,
 9466.0,
 9486.0,
 11897.0,
 11975.0,
 12572.0,
 12788.0,
 13673.0,
 13894.0,
 14844.0,
 14877.0,
 14984.0,
 15283.0,
 16440.0,
 16877.0,
 17604.0,
 18880.0,
 19905.0,
 20196.0,
 20534.0,
 20842.0,
 21535.0,
 23008.0,
 23053.0,
 23425.0,
 23692.0,
 23968.0,
 25077.0,
 25087.0,
 25116.0,
 27526.0,
 30313.0,
 30951.0,
 31837.0,
 31945.0,
 34503.0,
 34884.0,
 35011.0,
 40795.0,
 41437.0,
 46427.0,
 46758.0,
 48203.0,
 48584.0,
 48837.0,
 49735.0,
 51758.0,
 52529.0,
 53124.0,
 53760.0,
 56245.0,
 58441.0,
 58839.0,
 58858.0,
 59746.0,
 62156.0,
 62537.0,
 69348.0,
 74823.0,
 75659.0,
 78266.0,
 86824.0,
 88235.0,
 95100.0,
 135515.0]

In [391]:
global_salary_id = list(range(1,len(global_average_salary)+1))
global_salary_id

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76]

In [392]:
global_average_salary_mapping = dict(zip(global_average_salary,global_salary_id))
global_average_salary_mapping

{1284.0: 1,
 1553.0: 2,
 3419.0: 3,
 3434.0: 4,
 3582.0: 5,
 4613.0: 6,
 5261.0: 7,
 5267.0: 8,
 7474.0: 9,
 8380.0: 10,
 8392.0: 11,
 8535.0: 12,
 9466.0: 13,
 9486.0: 14,
 11897.0: 15,
 11975.0: 16,
 12572.0: 17,
 12788.0: 18,
 13673.0: 19,
 13894.0: 20,
 14844.0: 21,
 14877.0: 22,
 14984.0: 23,
 15283.0: 24,
 16440.0: 25,
 16877.0: 26,
 17604.0: 27,
 18880.0: 28,
 19905.0: 29,
 20196.0: 30,
 20534.0: 31,
 20842.0: 32,
 21535.0: 33,
 23008.0: 34,
 23053.0: 35,
 23425.0: 36,
 23692.0: 37,
 23968.0: 38,
 25077.0: 39,
 25087.0: 40,
 25116.0: 41,
 27526.0: 42,
 30313.0: 43,
 30951.0: 44,
 31837.0: 45,
 31945.0: 46,
 34503.0: 47,
 34884.0: 48,
 35011.0: 49,
 40795.0: 50,
 41437.0: 51,
 46427.0: 52,
 46758.0: 53,
 48203.0: 54,
 48584.0: 55,
 48837.0: 56,
 49735.0: 57,
 51758.0: 58,
 52529.0: 59,
 53124.0: 60,
 53760.0: 61,
 56245.0: 62,
 58441.0: 63,
 58839.0: 64,
 58858.0: 65,
 59746.0: 66,
 62156.0: 67,
 62537.0: 68,
 69348.0: 69,
 74823.0: 70,
 75659.0: 71,
 78266.0: 72,
 86824.0: 73,
 88235.0: 74,
 95100.0: 75,
 135515.0: 76}

In [393]:
clean_data_df['global_salary_id'] = clean_data_df['global_average_salary'].map(global_average_salary_mapping)

In [394]:
clean_data_df['global_salary_id']

0       55
1       55
2       55
3       55
4       55
        ..
9302    63
9303    62
9304    69
9305    68
9306    65
Name: global_salary_id, Length: 9307, dtype: int64

In [395]:
global_average_salary_dict = {'global_salary_id':global_salary_id, 'global_average_salary':global_average_salary}
global_average_salary_df = pd.DataFrame(global_average_salary_dict)
global_average_salary_df

    global_salary_id  global_average_salary
0                  1                 1284.0
1                  2                 1553.0
2                  3                 3419.0
3                  4                 3434.0
4                  5                 3582.0
..               ...                    ...
71                72                78266.0
72                73                86824.0
73                74                88235.0
74                75                95100.0
75                76               135515.0

[76 rows x 2 columns]

In [396]:
global_average_salary_df.to_csv("global_average_salary.csv")

## Create country table

In [397]:
country_df = clean_data_df[['country','global_salary_id']]

In [398]:
country_df.drop_duplicates(inplace=True)

C:\Users\vonke\AppData\Local\Temp\ipykernel_11028\2233811002.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  country_df.drop_duplicates(inplace=True)

In [399]:
country_df.reset_index(inplace=True,drop=True)

In [400]:
country_df = country_df.sort_values(by='country')

In [401]:
country_df.reset_index(inplace=True,drop=True)

In [402]:
country_df['country_id'] = list(range(1,len(country_df)+1))

In [403]:
country_df

                 country  global_salary_id  country_id
0                Andorra                56           1
1              Argentina                 2           2
2                Armenia                37           3
3              Australia                64           4
4                Austria                54           5
..                   ...               ...         ...
71  United Arab Emirates                53          72
72        United Kingdom                73          73
73         United States                75          74
74            Uzbekistan                 1          75
75               Vietnam                12          76

[76 rows x 3 columns]

In [404]:
country = country_df['country']
country

0                  Andorra
1                Argentina
2                  Armenia
3                Australia
4                  Austria
              ...
71    United Arab Emirates
72          United Kingdom
73           United States
74              Uzbekistan
75                 Vietnam
Name: country, Length: 76, dtype: object

In [405]:
country_id = country_df['country_id']
country_id

0      1
1      2
2      3
3      4
4      5
      ..
71    72
72    73
73    74
74    75
75    76
Name: country_id, Length: 76, dtype: int64

In [406]:
country_mapping = dict(zip(country,country_id))
country_mapping

{'Andorra': 1,
 'Argentina': 2,
 'Armenia': 3,
 'Australia': 4,
 'Austria': 5,
 'Belgium': 6,
 'Bolivia': 7,
 'Bosnia and Herzegovina': 8,
 'Brazil': 9,
 'Bulgaria': 10,
 'Canada': 11,
 'Central African Republic': 12,
 'Chile': 13,
 'Colombia': 14,
 'Costa Rica': 15,
 'Croatia': 16,
 'Cyprus': 17,
 'Czech Republic': 18,
 'Denmark': 19,
 'Ecuador': 20,
 'Egypt': 21,
 'Estonia': 22,
 'Finland': 23,
 'France': 24,
 'Georgia': 25,
 'Germany': 26,
 'Ghana': 27,
 'Greece': 28,
 'Honduras': 29,
 'Hong Kong': 30,
 'India': 31,
 'Indonesia': 32,
 'Iraq': 33,
 'Ireland': 34,
 'Italy': 35,
 'Japan': 36,
 'Jersey': 37,
 'Kenya': 38,
 'Latvia': 39,
 'Lithuania': 40,
 'Luxembourg': 41,
 'Malaysia': 42,
 'Malta': 43,
 'Mauritius': 44,
 'Mexico': 45,
 'Moldova': 46,
 'Netherlands': 47,
 'New Zealand': 48,
 'Nigeria': 49,
 'Pakistan': 50,
 'Peru': 51,
 'Philippines': 52,
 'Poland': 53,
 'Portugal': 54,
 'Puerto Rico': 55,
 'Qatar': 56,
 'Romania': 57,
 'Russia': 58,
 'Saudi Arabia': 59,
 'Serbia': 60,
 'Singapore': 61,
 'Slovenia': 62,
 'South Africa': 63,
 'Spain': 64,
 'Sweden': 65,
 'Switzerland': 66,
 'Thailand': 67,
 'Tunisia': 68,
 'Turkey': 69,
 'Uganda': 70,
 'Ukraine': 71,
 'United Arab Emirates': 72,
 'United Kingdom': 73,
 'United States': 74,
 'Uzbekistan': 75,
 'Vietnam': 76}

In [407]:
clean_data_df['country_id'] = clean_data_df['country'].map(country_mapping)

In [408]:
clean_data_df

,index,year,job_category,salary_in_usd,country,experience_level,work_setting,global_average_salary,global_salary_id,country_id
0,0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48584.0,55,26
1,1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48584.0,55,26
2,2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48584.0,55,26
3,3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48584.0,55,26
4,4,2023,Data Engineering,107968,Germany,Senior,Remote,48584.0,55,26
...,...,...,...,...,...,...,...,...,...,...
9302,9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58441.0,63,48
9303,9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.0,62,30
9304,9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.0,69,19
9305,9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.0,68,41
9306,9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.0,65,43

In [409]:
country_df.to_csv("country.csv")

## Create job table

In [410]:
job_df = clean_data_df[['job_category','experience_level']]

In [411]:
job_df

                 job_category experience_level
0            Data Engineering        Mid-level
1               Data Analysis        Mid-level
2     Machine Learning and AI           Senior
3     Machine Learning and AI           Senior
4            Data Engineering           Senior
...                       ...              ...
9302         Data Engineering           Senior
9303         Data Engineering        Mid-level
9304  Machine Learning and AI      Entry-level
9305            Data Analysis      Entry-level
9306         Data Engineering        Mid-level

[9307 rows x 2 columns]

In [412]:
job_df.drop_duplicates(inplace=True)

C:\Users\vonke\AppData\Local\Temp\ipykernel_11028\1880147904.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  job_df.drop_duplicates(inplace=True)

In [413]:
job_df.reset_index(inplace=True,drop=True)

In [414]:
job_df = job_df.sort_values(by='job_category')

In [415]:
job_df.reset_index(inplace=True,drop=True)

In [416]:
job_df['job_id'] = list(range(1,len(job_df)+1))

In [417]:
job_df

                      job_category experience_level  job_id
0             BI and Visualization        Mid-level       1
1             BI and Visualization           Senior       2
2             BI and Visualization        Executive       3
3             BI and Visualization      Entry-level       4
4               Cloud and Database           Senior       5
5                    Data Analysis           Senior       6
6                    Data Analysis        Executive       7
7                    Data Analysis      Entry-level       8
8                    Data Analysis        Mid-level       9
9   Data Architecture and Modeling        Mid-level      10
10  Data Architecture and Modeling           Senior      11
11  Data Architecture and Modeling        Executive      12
12                Data Engineering        Executive      13
13                Data Engineering           Senior      14
14                Data Engineering      Entry-level      15
15                Data Engineering        Mid-level      16
16    Data Management and Strategy           Senior      17
17    Data Management and Strategy        Mid-level      18
18    Data Management and Strategy      Entry-level      19
19     Data Quality and Operations        Mid-level      20
20     Data Quality and Operations           Senior      21
21     Data Quality and Operations      Entry-level      22
22       Data Science and Research        Executive      23
23       Data Science and Research      Entry-level      24
24       Data Science and Research        Mid-level      25
25       Data Science and Research           Senior      26
26       Leadership and Management           Senior      27
27       Leadership and Management      Entry-level      28
28       Leadership and Management        Executive      29
29       Leadership and Management        Mid-level      30
30         Machine Learning and AI      Entry-level      31
31         Machine Learning and AI        Mid-level      32
32         Machine Learning and AI        Executive      33
33         Machine Learning and AI           Senior      34

In [418]:
job_category = job_df['job_category']
job_category

0               BI and Visualization
1               BI and Visualization
2               BI and Visualization
3               BI and Visualization
4                 Cloud and Database
5                      Data Analysis
6                      Data Analysis
7                      Data Analysis
8                      Data Analysis
9     Data Architecture and Modeling
10    Data Architecture and Modeling
11    Data Architecture and Modeling
12                  Data Engineering
13                  Data Engineering
14                  Data Engineering
15                  Data Engineering
16      Data Management and Strategy
17      Data Management and Strategy
18      Data Management and Strategy
19       Data Quality and Operations
20       Data Quality and Operations
21       Data Quality and Operations
22         Data Science and Research
23         Data Science and Research
24         Data Science and Research
25         Data Science and Research
26         Leadership and Management
27         Leadership and Management
28         Leadership and Management
29         Leadership and Management
30           Machine Learning and AI
31           Machine Learning and AI
32           Machine Learning and AI
33           Machine Learning and AI
Name: job_category, dtype: object

In [419]:
job_id = job_df['job_id']
job_id

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
29    30
30    31
31    32
32    33
33    34
Name: job_id, dtype: int64

In [420]:
experience_level = job_df['experience_level']
experience_level

0       Mid-level
1          Senior
2       Executive
3     Entry-level
4          Senior
5          Senior
6       Executive
7     Entry-level
8       Mid-level
9       Mid-level
10         Senior
11      Executive
12      Executive
13         Senior
14    Entry-level
15      Mid-level
16         Senior
17      Mid-level
18    Entry-level
19      Mid-level
20         Senior
21    Entry-level
22      Executive
23    Entry-level
24      Mid-level
25         Senior
26         Senior
27    Entry-level
28      Executive
29      Mid-level
30    Entry-level
31      Mid-level
32      Executive
33         Senior
Name: experience_level, dtype: object

In [421]:
job_mapping = dict(zip(zip(job_df['job_category'], job_df['experience_level']), job_df['job_id']))
job_mapping

{('BI and Visualization', 'Mid-level'): 1,
 ('BI and Visualization', 'Senior'): 2,
 ('BI and Visualization', 'Executive'): 3,
 ('BI and Visualization', 'Entry-level'): 4,
 ('Cloud and Database', 'Senior'): 5,
 ('Data Analysis', 'Senior'): 6,
 ('Data Analysis', 'Executive'): 7,
 ('Data Analysis', 'Entry-level'): 8,
 ('Data Analysis', 'Mid-level'): 9,
 ('Data Architecture and Modeling', 'Mid-level'): 10,
 ('Data Architecture and Modeling', 'Senior'): 11,
 ('Data Architecture and Modeling', 'Executive'): 12,
 ('Data Engineering', 'Executive'): 13,
 ('Data Engineering', 'Senior'): 14,
 ('Data Engineering', 'Entry-level'): 15,
 ('Data Engineering', 'Mid-level'): 16,
 ('Data Management and Strategy', 'Senior'): 17,
 ('Data Management and Strategy', 'Mid-level'): 18,
 ('Data Management and Strategy', 'Entry-level'): 19,
 ('Data Quality and Operations', 'Mid-level'): 20,
 ('Data Quality and Operations', 'Senior'): 21,
 ('Data Quality and Operations', 'Entry-level'): 22,
 ('Data Science and Research', 'Executive'): 23,
 ('Data Science and Research', 'Entry-level'): 24,
 ('Data Science and Research', 'Mid-level'): 25,
 ('Data Science and Research', 'Senior'): 26,
 ('Leadership and Management', 'Senior'): 27,
 ('Leadership and Management', 'Entry-level'): 28,
 ('Leadership and Management', 'Executive'): 29,
 ('Leadership and Management', 'Mid-level'): 30,
 ('Machine Learning and AI', 'Entry-level'): 31,
 ('Machine Learning and AI', 'Mid-level'): 32,
 ('Machine Learning and AI', 'Executive'): 33,
 ('Machine Learning and AI', 'Senior'): 34}

In [422]:
def map_job_id(row):
    return job_mapping.get((row['job_category'], row['experience_level']))

clean_data_df['job_id'] = clean_data_df.apply(map_job_id, axis=1)

In [423]:
clean_data_df

,index,year,job_category,salary_in_usd,country,experience_level,work_setting,global_average_salary,global_salary_id,country_id,job_id
0,0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48584.0,55,26,16
1,1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48584.0,55,26,9
2,2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48584.0,55,26,34
3,3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48584.0,55,26,34
4,4,2023,Data Engineering,107968,Germany,Senior,Remote,48584.0,55,26,14
...,...,...,...,...,...,...,...,...,...,...,...
9302,9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58441.0,63,48,14
9303,9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.0,62,30,16
9304,9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.0,69,19,31
9305,9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.0,68,41,8
9306,9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.0,65,43,16

In [424]:
job_df.to_csv("job.csv")

## Create work setting table

In [425]:
work_setting_df = clean_data_df[['work_setting']]

In [426]:
work_setting_df

     work_setting
0          Hybrid
1          Hybrid
2          Hybrid
3          Remote
4          Remote
...           ...
9302       Hybrid
9303       Hybrid
9304       Hybrid
9305       Remote
9306       Hybrid

[9307 rows x 1 columns]

In [427]:
work_setting_df.drop_duplicates(inplace=True)

C:\Users\vonke\AppData\Local\Temp\ipykernel_11028\1657826210.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  work_setting_df.drop_duplicates(inplace=True)

In [428]:
work_setting_df.reset_index(inplace=True,drop=True)

In [429]:
work_setting_df = work_setting_df.sort_values(by='work_setting')

In [430]:
work_setting_df.reset_index(inplace=True,drop=True)

In [431]:
work_setting_df['work_setting_id'] = list(range(1,len(work_setting_df)+1))

In [432]:
work_setting_df

  work_setting  work_setting_id
0       Hybrid                1
1    In-person                2
2       Remote                3

In [433]:
work_setting = work_setting_df['work_setting']
work_setting

0       Hybrid
1    In-person
2       Remote
Name: work_setting, dtype: object

In [434]:
work_setting_id = work_setting_df['work_setting_id']
work_setting_id

0    1
1    2
2    3
Name: work_setting_id, dtype: int64

In [435]:
work_setting_mapping = dict(zip(work_setting,work_setting_id))
work_setting_mapping

{'Hybrid': 1, 'In-person': 2, 'Remote': 3}

In [436]:
clean_data_df['work_setting_id'] = clean_data_df['work_setting'].map(work_setting_mapping)

In [437]:
clean_data_df

,index,year,job_category,salary_in_usd,country,experience_level,work_setting,global_average_salary,global_salary_id,country_id,job_id,work_setting_id
0,0,2023,Data Engineering,95012,Germany,Mid-level,Hybrid,48584.0,55,26,16,1
1,1,2023,Data Analysis,42107,Germany,Mid-level,Hybrid,48584.0,55,26,9,1
2,2,2023,Machine Learning and AI,64781,Germany,Senior,Hybrid,48584.0,55,26,34,1
3,3,2023,Machine Learning and AI,129562,Germany,Senior,Remote,48584.0,55,26,34,3
4,4,2023,Data Engineering,107968,Germany,Senior,Remote,48584.0,55,26,14,3
...,...,...,...,...,...,...,...,...,...,...,...,...
9302,9302,2020,Data Engineering,125000,New Zealand,Senior,Hybrid,58441.0,63,48,14,1
9303,9303,2021,Data Engineering,66022,Hong Kong,Mid-level,Hybrid,56245.0,62,30,16,1
9304,9304,2020,Machine Learning and AI,45896,Denmark,Entry-level,Hybrid,69348.0,69,19,31,1
9305,9305,2021,Data Analysis,59102,Luxembourg,Entry-level,Remote,62537.0,68,41,8,3
9306,9306,2021,Data Engineering,28369,Malta,Mid-level,Hybrid,58858.0,65,43,16,1

In [438]:
work_setting_df.to_csv("work_setting.csv")

## Create employee table

In [439]:
employee_df = clean_data_df

In [440]:
employee_df = employee_df.drop(['job_category', 'country','salary_in_usd','experience_level','global_average_salary'], axis=1)

In [441]:
employee_df

,index,year,work_setting,global_salary_id,country_id,job_id,work_setting_id
0,0,2023,Hybrid,55,26,16,1
1,1,2023,Hybrid,55,26,9,1
2,2,2023,Hybrid,55,26,34,1
3,3,2023,Remote,55,26,34,3
4,4,2023,Remote,55,26,14,3
...,...,...,...,...,...,...,...
9302,9302,2020,Hybrid,63,48,14,1
9303,9303,2021,Hybrid,62,30,16,1
9304,9304,2020,Hybrid,69,19,31,1
9305,9305,2021,Remote,68,41,8,3
9306,9306,2021,Hybrid,65,43,16,1

In [442]:
employee_df.to_csv("employee.csv")